<template>
  <section>
    <el-form :inline="true">
      <el-form-item label="标题：">
        <el-input placeholder="标题" size="small" clearable maxlength="30"></el-input>
      </el-form-item>
      <el-form-item label="关键词：">
        <el-input placeholder="关键词" size="small" clearable maxlength="30"></el-input>
      </el-form-item>
      <el-form-item label="媒体类别：">
        <el-input placeholder="媒体类别" size="small" clearable maxlength="30"></el-input>
      </el-form-item>
      <el-form-item label="来源：">
        <el-input placeholder="来源" size="small" clearable maxlength="30"></el-input>
      </el-form-item>
      <el-form-item label="倾向性：">
        <el-select v-model="qxx" placeholder="请选择">
          <el-option value="0" label="中性"></el-option>
          <el-option value="1" label="正面"></el-option>
          <el-option value="2" label="负面"></el-option>
        </el-select>
      </el-form-item>
      <el-form-item label="作者：">
        <el-input placeholder="作者" size="small" clearable maxlength="30"></el-input>
      </el-form-item>
      <el-form-item label="发布时间">
        <el-date-picker type="date" placeholder="填报时间" size="small"></el-date-picker>
      </el-form-item>
      <el-form-item>
        <el-button type="primary" size="small" @click="query(true,true)">查询</el-button>
        <el-button size="small"  @click="clear">重置</el-button>
      </el-form-item>
    </el-form>
    <el-table :data="list" v-loading="listLoading" style="width: 100%;" :max-height="tableHeight">
      <el-table-column prop="tendency" label="倾向性" width="115"></el-table-column>
      <el-table-column prop="topicName" label="专题名称" width="140"></el-table-column>
      <el-table-column label="标题" width="300">
        <template slot-scope="scope">
          <p :title="scope.row.title" class="ellipsis-word">{{scope.row.title}}</p>
        </template>
      </el-table-column>
      <el-table-column prop="source" label="来源" width="140"></el-table-column>
      <el-table-column prop="channel" label="频道" width="140"></el-table-column>
      <el-table-column label="要闻链接地址" width="300">
        <template slot-scope="scope">
          <p :title="scope.row.linkAddress" class="ellipsis-word">{{scope.row.linkAddress}}</p>
        </template>
      </el-table-column>
      <!--<el-table-column prop="browseNumber" label="浏览数" width="80"></el-table-column>-->
      <!--<el-table-column prop="answerNumber" label="回复数" width="80"></el-table-column>-->
      <!--<el-table-column prop="reprintNumber" label="转载数" width="80"></el-table-column>-->
      <el-table-column prop="keyword" label="关键词" width="140"></el-table-column>
      <el-table-column prop="type" label="媒体类别" width="140"></el-table-column>
      <el-table-column prop="author" label="作者" width="140"></el-table-column>
      <el-table-column prop="releaseTime" label="发布时间" width="180"></el-table-column>
      <!--<el-table-column prop="grabTime" label="抓取时间" width="180"></el-table-column>-->
      <!--<el-table-column prop="summaryNumber" label="摘要字数" width="130"></el-table-column>-->
      <!--<el-table-column label="新闻摘要" width="180">-->
        <!--<template slot-scope="scope">-->
          <!--<p :title="scope.row.summary" class="ellipsis-word">{{scope.row.summary}}</p>-->
        <!--</template>-->
      <!--</el-table-column>-->
      <!--<el-table-column prop="wordNumber" label="文字字数" width="180"></el-table-column>-->
      <!--<el-table-column prop="enable" label="是否启用" ></el-table-column>-->
      <el-table-column label="操作" width="100">
        <template slot-scope="scope">
          <el-button title="提取" size="mini" type="primary" icon="el-icon-plus" circle
                     @click="handleEdit(scope.row)"></el-button>
          <el-button title="详情" size="mini" type="primary" icon="el-icon-document" circle
                     @click="handleDetail(scope.row)"></el-button>
        </template>
      </el-table-column>
    </el-table>
    <!--工具条-->
    <el-col :span="24" class="toolbar">
      <el-pagination  layout="total, sizes, prev, pager, next, jumper" @current-change="handleCurrentChange" :page-sizes="[15,30,50,100]" @size-change="handleSizeChange"
                     :page-size="pageSize" :total="total" :current-page="page" style="float:right;">
      </el-pagination>
    </el-col>
  </section>
</template>
<script>
  export default {
    name: 'list',
    data() {
      return {
        qxx: {},
        total: 0,
        page: 1,
        pageSize: 15,
        listLoading: false,
        filters: {}, // 查询条件
        list: [{
          tendency: '中性',
          topicName: '地域信息',
          title: '我区召开2019年污染防治“四大保卫战”半年工作会',
          source: '西安市鄠邑区政府网',
          channel: '',
          linkAddress: 'http://www.xahy.gov.cn/xwzx/heyw/81488.htm',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '38',
          keyword: '西安市鄠邑区',
          type: '新闻',
          author: '融媒体',
          releaseTime: '2019-05-17 09:42:31',
          grabTime: '2019-05-18 09:42:48',
          summaryNumber: '102',
          summary: '8月21日下午，我区召开2019年污染防治“四大保卫战”半年工作会。区长裴靖瑜，区领导毛安、王凯、杨战海，各部门、各镇街、景区管理局，各园区主要负责同志参加。会上，副区长杨战海传达了西安市铁腕治霾工作第四次例会暨四大保卫战推进工作会会议精神，并安排下一阶段重点工作。',
          wordNumber: '1130',
          content: '为扎实开展2019年蓝天、碧水、净土、青山四大保卫战，全面推进污染防治工作，确保各项任务明确、措施落地见效，5月16日下，区委、区政府召开2019年污染防治四大保卫战暨夏季秸秆禁烧工作部署动员大会。区领导张阅农，裴靖瑜，张萍，惠军民，毛安、谢永平、杨战海及相关单位主要负责人的参加。\n' +
          '\n' +
          '会上，副区长杨战海传达市四大保卫战会议精神，总结2018年工作开展情况，安排部署2019年四大保卫战工作及夏季秸秆禁烧工作；传达《汾渭平原大气污染防治强化监管前20轮督办问题及热点网格工作可能被问责情况的通报》精神，并安排我区近期相关工作。\n' +
          '\n' +
          '区委常委、区纪委书记、监委会主任惠军民对生态环境部联合5省2市政府下发的《京津冀及周边地区2018-2019年秋冬季大气污染综合治理攻坚行动量化问责规定》的通知进行了解读。\n' +
          '\n' +
          '区政府副区长毛安主持会议，并宣读2018年铁腕治霾优秀三级网格及2018年禁烧先进单位奖励通报。\n' +
          '\n' +
          '副区长谢永平宣读《西安市鄠邑区农村人居环境整治工作领导小组办公室关于4月份全区“春满西安·净美鄠邑”及健康村庄创建行动“十名先进村”和“十名后进村”的通报》、《西安市鄠邑区农村人居环境整治工作领导小组办公室关于颁发4月份村庄清洁行动流动红（黄）旗的通知》。\n' +
          '\n' +
          '会议期间，区领导向2018年铁腕治霾优秀三级网格、2018年禁烧先进单位和4月份农村人居环境整治工作先进单位颁奖。涝店镇、区投资工信局、市生态环境局鄠邑分局、区水务局、区秦岭保护局主要负责同志就四大保卫战及秸秆禁烧工作进行表态发言。\n' +
          '\n' +
          '区投资工信局、区发改委、区农业局、市生态环境局鄠邑分局、市资源规划局鄠邑分局、区住建局、区交通局、区城管局负责同志现场领取任务移交单。\n' +
          '\n' +
          '最后，区长裴靖瑜就坚决打好打赢四大保卫战、做好夏季秸秆禁烧和人居环境整治提出三点要求：\n' +
          '\n' +
          '一是统一思想、认清形势，切实扛起生态环境保护政治责任。生态文明建设是关系人民福祉、关系中华民族永续发展的根本大计，生态环境是关系党的使命宗旨的重大政治问题，也是关系民生的重大社会问题。我们必须切实提高政治站位，自觉扛起政治责任，思想上高度重视，落实上不打折扣，行动上措施得力，坚决打好打赢环境污染防治攻坚战；  \n' +
          '\n' +
          '二是突出重点、精准发力，铁腕推进污染防治和环境整治工作。污染防治工作是一场输不起的硬仗，我们必须保持清醒的头脑，保持战略定力，正视存在问题，把握难得机遇，以强烈的使命担当和时不待我的紧迫感扎实推动工作落实；\n' +
          '\n' +
          '三是强化领导、夯实责任，尽快形成协同攻坚的强大合力。污染防治和环境整治具有长期性、艰巨性、复杂性，蓝天、碧水、青山、净土四场保卫战，场场都是大仗、硬仗、攻坚仗，绝不是吹响冲锋号、打几个冲锋，就能大功告成的。在污染防治攻坚的关键时刻，各级各部门要再加压、再加力、再加劲，必须保持加强生态环境保护、打赢污染防治攻坚战、提升农村人居环境的定力，决不能在思想上、行动上出现半点动摇、松劲，决不能以各种理由“开口子”。'
        }, {
          tendency: '中性',
          topicName: '地域信息',
          title: '转发微博@重拳出击！陕西省公安厅部署打击食药环犯罪“昆仑”行动',
          source: '新浪微博',
          channel: '',
          linkAddress: 'http://weibo.com/5601333936/HAXEL5uYn',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '19',
          keyword: '陕西',
          type: '微博',
          author: '苗巧颖',
          releaseTime: '2019-08-19 09:39:18',
          grabTime: '2019-08-20 09:39:57',
          summaryNumber: '97',
          summary: '陕西省公安厅在全省公安机关部署开展打击食药环犯罪“昆仑”行动，重拳出击食药环领域和侵犯知识产权突出违法犯罪，维护群众饮食用药和环境安全。此次“昆仑”行动从即日起持续至年底。省公安厅要求全省各级公安机关坚持“打源头、端窝点、催网络、断链条、追流向”的打击目标，向食药环、知识产权犯罪发起凌厉攻势，集中力量侦破大要案件，摧毁犯罪链条，确保专项行动取得实效。',
          wordNumber: '209',
          content: '8月8日，陕西省公安厅在全省公安机关部署开展打击食药环犯罪“昆仑”行动，重拳出击食药环领域和侵犯知识产权突出违法犯罪，维护群众饮食用药和环境安全。\n' +
          '\n' +
          '　　此次“昆仑”行动从即日起持续至年底。省公安厅要求全省各级公安机关坚持“打源头、端窝点、催网络、断链条、追流向”的打击目标，向食药环、知识产权犯罪发起凌厉攻势，集中力量侦破大要案件，摧毁犯罪链条，确保专项行动取得实效。\n' +
          '\n' +
          '　　“昆仑”行动期间，全省公安机关将同步开展专门针对食品安全犯罪、药品安全犯罪、侵权假冒犯罪和破坏生态环境犯罪的四方面具体行动。群众最为关心的涉及米面油、肉制品、乳制品安全犯罪，外卖黑作坊、“三无”小食品，假劣农药化肥种子、假劣疫苗、美容产品、骗取医保犯罪、侵犯知识产权犯罪，以及破坏秦岭野生动物资源犯罪等，均在此次专项行动重点打击范围之列。全省各级公安机关将坚持上游下游一起打、源头末端一起查，加强与行政监管部门和互联网企业的协作，做到线上线下合力精准打击，实现打击效果最大化。'
        }, {
          tendency: '负面',
          topicName: '地域信息',
          title: '池水清澈可见底 西安对黑臭水体整治见成效',
          source: '都市热线',
          channel: '01版',
          linkAddress: 'http://szb.northnews.cn/nmgrb/html/2019-06/28/content_16072_82797.html',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '180',
          keyword: '西安',
          type: '新闻',
          author: '秦秦',
          releaseTime: '2019-07-28 12:25:31',
          grabTime: '2019-07-29 09:26:39',
          summaryNumber: '149',
          summary: '12月16日，市黑臭水体整治整改攻坚作战指挥部到经开区、未央区、灞桥区和临潼区等多个黑臭水体治理点位，督导检查整治整改工作进度，现场检查记录整改情况',
          wordNumber: '352',
          content: '12月16日，市黑臭水体整治整改攻坚作战指挥部到经开区、未央区、灞桥区和临潼区等多个黑臭水体治理点位，督导检查整治整改工作进度，现场检查记录整改情况。\n' +
          '\n' +
          '依据黑臭水体排查结果，现场检查了经开区1处、未央区2处、灞桥区2处、临潼区5处共10处黑臭水体整治情况。其中2处为景观水体，分别是经开区华山机械厂住宅小区景观池和灞桥区纺织城景观湖；1处涝池，位于灞桥区枣园苏村；其他均为河道、沟渠类黑臭水体，分别是未央区红旗西渠、红旗中渠、临潼区临河骊山微电子公司——格林幼儿园段、秦陵南路北侧——电大南侧段、汽车站西北角—人民北路临河桥段、五里河红衫郡西门口——陇海铁路段、体育场东北角——东篱雅舍段。\n' +
          '\n' +
          '景观水体已基本整治到位\n' +
          '\n' +
          '记者跟随督导检查工作人员来到经开区华山机械厂住宅小区的景观池，可以看到池水较为清澈，许多群众在景观池周围的空地上下棋、锻炼等。据了解，针对景观类水体的整治工作较为简单，在抽水清淤、更换池水的基础上，进行漂浮树叶打捞，目前已达到整治效果。在灞桥区纺织公园的景观湖，记者看到池水经整治后已经可见池底，公园内群众反映对湖水水质较为满意。'
        }, {
          tendency: '负面',
          topicName: '地域信息',
          title: '#前7个月安康空气质量严重下滑 5个县区优良天气至少减少15天',
          source: '新浪微博',
          channel: '',
          linkAddress: 'http://weibo.com/3917895981/HAXz6ldwd',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '101',
          keyword: '陕西',
          type: '微博',
          author: '孟云',
          releaseTime: '2019-07-01 09:42:31',
          grabTime: '2019-07-02 09:42:48',
          summaryNumber: '70',
          summary: '近期，安康市召开了“全市散煤治理推进工作视频会”。安康市生态环境局相关数据显示：今年1-7月，汉阴、岚皋、宁陕、石泉、旬阳5个县区的优良天数较以往减少15天及以上（其中，汉阴减少20天、岚皋减少17天、宁陕减少16天、石泉和旬阳各减少15天）。',
          wordNumber: '1130',
          content: '近期，安康市召开了“全市散煤治理推进工作视频会”。安康市生态环境局相关数据显示：今年1-7月，汉阴、岚皋、宁陕、石泉、旬阳5个县区的优良天数较以往减少15天及以上（其中，汉阴减少20天、岚皋减少17天、宁陕减少16天、石泉和旬阳各减少15天）。\n' +
          '\n' +
          '记者从安康市生态环境局了解到，今年1—7月份安康中心城区优良天数181天，同比减少10天，（含汉滨区、高新区、恒口示范区、瀛湖生态旅游区）环境空气质量综合指数为4.31，同比上升10.8%；其中，PM10、PM2.5平均浓度分别为73微克/立方米、43微克/立方米，分别同比上升10.6%和16.2%。\n' +
          '\n' +
          '数据还显示，全市PM2.5浓度上升幅度在20%以上的有旬阳47%、白河27%、宁陕25%、石泉和紫阳各22%、汉阴和岚皋各21%。从总体看，全市环境空气质量呈严重下滑态势，大气污染防治形势异常严峻。'
        }, {
          tendency: '中性',
          topicName: '地域信息',
          title: '咸阳持续发力打好蓝天保卫战',
          source: '咸阳新闻网',
          channel: '02版',
          linkAddress: 'http://www.tongliaowang.com/xnmgxw/2019/0628/99365846.html',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '10',
          keyword: '咸阳 发力 蓝天保卫战',
          type: '新闻',
          author: '王保训',
          releaseTime: '2019-06-28 09:18:30',
          grabTime: '2019-06-28 09:19:31',
          summaryNumber: '147',
          summary: '今年以来，全市上下认真学习贯彻习近平生态文明思想，将打好污染防治攻坚战特别是打赢蓝天保卫战作为重要政治任务、重大民生工程，摆在了全局工作中更加重要的位置，通过聚焦减煤、抑尘、控车、治源，以结构、工程、管理性措施并举，全面推进大气污染治理。',
          wordNumber: '695',
          content: '2018年，长武县认真践行“绿水青山就是金山银山”发展理念，以工业废气、扬尘、机动车尾气、餐饮油烟等大气治理重点为突破口，强化领导、管控源头、狠抓落实，大力实施系统、源头、科学、依法治理大气污染。1-10月，空气优良天数达到201天，大气污染防治成效初显。\n' +
          '\n' +
          '强化组织领导，完善工作机制，不断夯实大气污染治理基础保障。\n' +
          '\n' +
          '建立健全大气污染防治工作机制。县委县政府将“铁腕治霾、打赢蓝天保卫战”作为重点工作持续推进。成立以县委主要领导任组长的县生态环境保护工作领导小组，下设“生态办”，抽调人员集中办公，统筹推进全县铁腕治霾及生态环境保护各项工作。多次召开专题会议研究部署铁腕治霾工作，制定印发了《长武县铁腕治霾打赢蓝天保卫战2018年工作实施方案及3个办法34个专项实施方案》等文件，明确各部门各负其责、合力攻坚要求，完善各镇（街道）基层环保站人员和办公配置，全县上下形成了高位推进、齐抓共管、高效运转的大气污染防治工作大格局。\n' +
          '\n' +
          '强化大气污染督查检查力度。从县生态办、县环保局抽调人员成立督查检查组，每天对县城建筑工地进行检查，加强对扬尘污染防治的现场督查督办力度，对检查发现问题及时移交相关部门落实整改，对整改不力、履职不到位的部门严格问责，实施责任追究。今年以来，县生态办共下发督办180件，目前督办问题已基本整改到位。\n' +
          '\n' +
          '坚持源头管控，强化执法监管，刚性落实各项大气污染治理措施。\n' +
          '\n' +
          '严把项目准入关。结合环境功能区规划、污染物达标和总量控制等原则，严格项目环评审批，限制能耗高、污染大的项目进驻。今年来，共审批新建项目环境影响评价报告书1个、报告表14个，否决（暂缓审批）涉气项目3个。\n' +
          '\n' +
          '加强废气执法监管。坚持“严”字当头，切实加大废气执法监管力度，始终保持严厉打击环境违法行为的高压力度，做到监管不留死角，执法不存盲区。1-10月份，环保部门共查处涉气案件7件,处罚款34.05万元；相关职能部门查处餐饮门店9家、流动饮食摊点28家、烟花爆竹违规燃放11件，取缔整治“散乱污”企业31家。'
        }, {
          tendency: '正面',
          topicName: '地域信息',
          title: '“退耕还林第一市”延安 2017年全市植被覆盖达81.3%',
          source: '微信公号“长安街知事”',
          channel: '',
          linkAddress: 'http://szb.northnews.cn/bfxb/html/2019-06/28/content_16057_82723.htm',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '151',
          keyword: '陕西，延安',
          type: '公众号',
          author: '秦秦',
          releaseTime: '2019-06-28 09:42:31',
          grabTime: '2019-06-28 09:42:48',
          summaryNumber: '50',
          summary: '陕西退耕还林努力了20年，延安市被称为“退耕还林第一市”，那么延安是如何“变兄妹开荒为兄妹造林”的呢?有哪些成就和经验?',
          wordNumber: '1084',
          content: '据史书记载，延安曾是水草丰盛、牛羊衔尾。明、清以来，滥垦、滥牧、战乱使生态环境几近崩溃，陷入了“越垦越荒、越荒越穷、越穷越垦”的恶性循环。\n' +
          '\n' +
          '到上世纪末，延安成为黄土高原水土流失最严重的地区，年入黄泥沙2.58亿吨，约占入黄泥沙总量的1/6。春秋两季沙尘遮天盖地，民众苦不堪言。联合国粮农组织专家考察延安后曾断言：这里不具备人类生存的基本条件。\n' +
          '\n' +
          '1998年，延安市先于全国在吴起县开始封禁退耕，开启了全国封山禁牧退耕还林的先河。\n' +
          '\n' +
          '1999年起，延安市委、市政府积极响应党中央、国务院号召，以“退耕还林统揽农业农村工作全局”的思路，在全国率先开始大规模退耕还林，成为全国最早的退耕还林试点之一。退耕还林后延安的森林覆盖率达到46.35%。据陕西省农业遥感中心提供的数据显示，实施退耕还林以来，全市的植被覆盖度由2000年的46%提高到2017年的81.3%。\n' +
          '\n' +
          '通过2000年以后逐年的卫星遥感图对比，可以清晰地看到，延安实施退耕还林区域的颜色明显变绿变深，植被覆盖度上升趋势尤为显著。\n' +
          '\n' +
          '气象资料显示，退耕还林后，延安的沙尘天气明显减少，城区空气“优、良”天数从2001年的238天增加到2017年的313天，全市水土流失综合治理程度达到68%，入黄泥沙由每年的2.58亿吨降为0.31亿吨，降幅88%;土壤侵蚀模数由每年每平方公里9000吨降为1077吨，降幅为88%。'
        }, {
          tendency: '负面',
          topicName: '地域信息',
          title: '将污泥挖坑掩埋 延安卷烟厂被罚10万元',
          source: '延安日报社',
          channel: '舆情',
          linkAddress: 'http://art.workercn.cn/32669/201906/28/190628090213194.shtml',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '4',
          keyword: '延安',
          type: '新闻',
          author: '肖金雄',
          releaseTime: '2019-07-02 09:03:10',
          grabTime: '2019-07-03 09:27:21',
          summaryNumber: '148',
          summary: '偷偷将过滤产生的污泥挖坑掩埋，本以为可以掩人耳目，不料却被附近群众发现并举报。近日，延安市生态环境局宝塔分局对延安卷烟厂罚款10万元，并责令企业限期整改。',
          wordNumber: '614',
          content: '近日，根据延安市生态环境局消息，省生态环境厅高巍专员一行来延，督导检查该局系统扫黑除恶专项斗争工作，同时抽查了线索摸排表中宝塔区上报的“群众举报延安市卷烟厂倾倒掩埋危险废弃物”线索的整改情况和宝塔分局对该案的查处情况。\n' +
          '\n' +
          '位于延安市姚店工业园区的延安卷烟厂，为陕西中烟工业有限责任公司下属单位之一。\n' +
          '\n' +
          '7月1日下午，延安卷烟厂办公室的一名工作人员称，此事处理结果已经给延安市生态环境局宝塔分局反馈过的，其他具体情况他需要去了解下。\n' +
          '\n' +
          '随后，华商报-二三里记者从宝塔区环境监察大队了解到，此事发生在今年3月份，检查发现延安卷烟厂在拆过滤器污泥时，偷偷将污泥挖坑后掩埋，没有经过相应的处理，因此对卷烟厂这一环境违法行为进行了立案查处。\n' +
          '\n' +
          '针对延安卷烟厂这一行为，环保部门对其作出经济处罚10万元，并责令限期整改，要求将掩埋的污泥清理出来，按照相关规定予以处理。'
        }, {
          tendency: '中性',
          topicName: '地域信息',
          title: '//@昭杨-洛川2名相关责任人因北洛河污染事件受处分',
          source: '新浪微博',
          channel: '',
          linkAddress: 'http://weibo.com/2842509604/HAXp8b2zS',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '10',
          keyword: '北洛河',
          type: '微博',
          author: '云暖深野',
          releaseTime: '2019-08-08 09:00:48',
          grabTime: '2019-08-09 09:01:05',
          summaryNumber: '42',
          summary: '4月18日，北洛河下游水面发现约300米长黑色污染物。经查，系延安石油化工厂非法排放污水所致，洛川当地两名相关责任人因履职不力受到政务警告处分。',
          wordNumber: '500',
          content: '4月18日，北洛河下游水面发现约300米长黑色污染物。经查，系延安石油化工厂非法排放污水所致，洛川当地两名相关责任人因履职不力受到政务警告处分。\n' +
          '\n' +
          '陕西省生态环境厅此前通报称，事发后，省、市、县生态环境部门积极响应，迅即组织力量在铜川市宜君县下桃水电站库区内设置关键性拦截措施，通过在坝内投放吸油毡、吸油垫、活性炭等污染消解物资，成功将污染团拦截在铜川市宜君县下桃水电站库区内。此次污染未对当地群众生产生活及饮水安全造成明显影响。\n' +
          '\n' +
          '6月27日，延安市生态环境局洛川分局公示了此次北洛河污染的原因。公示称，执法人员在延安石油化工厂雨水排口发现疑似污染物排放痕迹。管内有黑色排放物质，管内残余物已取样化验。雨水排污口周边有疑似黑色絮状物。经过对延安石油化工厂污水车间相关人员谈话确定为该厂雨水监控池存放的废水通过雨水管网外排。洛川分局责令企业实施限产，停运部分生产车间，全面落实各项整改措施，在整改行为未落实到位前不得恢复生产。同时，4名相关责任人分别被处以十五天行政拘留。\n' +
          '\n' +
          '近日，洛川县纪律检查委员会、监察委通报了八起破坏生态环保典型问题，华商报记者注意到，有两起涉及到此次北洛河污染事件。\n' +
          '\n' +
          '通报称，4月17日下午6时左右，延安石油化工厂污水处理车间主任袁某指示技术员惠某班组在18日1时40分至3时10分，排放了雨水监控池长期收集的初期雨水、生产水、生活水、除盐废水和消防水等污水，造成北洛河流域水体发生污染。\n' +
          '\n' +
          '洛川县水政水资源管理局（县节约用水办、水政监察大队）局长（大队长）郑晓荣履职不力，对延安石油化工厂排放污水致使北洛河流域水体发生污染一事，负有监督不到位的责任。县监察委给予郑晓荣政务警告处分；交口河镇党委委员、副镇长拓亚军身为交口河镇环境保护分管领导，履职不力，对延安石油化工厂排放污水致使北洛河流域水体发生污染一事，负有监督不到位的责任。县监察委给予拓亚军政务警告处分。'
        }, {
          tendency: '中性',
          topicName: '地域信息',
          title: '壮丽70年 奋斗新时代丨延安：山川大地由黄到绿 产业发展“有中生新”',
          source: '陕西日报',
          channel: '',
          linkAddress: 'http://news.cnwest.com/sxxw/6882779422/HAXm6xmo5',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '19',
          keyword: '延安',
          type: '微博',
          author: '用户',
          releaseTime: '2019-06-28 08:53:21',
          grabTime: '2019-06-28 08:55:43',
          summaryNumber: '129',
          summary: '记者从我省“奋力追赶超越 庆祝新中国成立70周年”系列新闻发布会第六场发布会上获悉：新中国成立70年来，延安人民继承发扬延安精神，埋头苦干，奋发图强，使山川大地逐渐实现由黄到绿的历史性转变，经济社会发展取得举世瞩目的成就。',
          wordNumber: '1183',
          content: '革命圣地延安的70年，是自力更生、艰苦奋斗的70年，也是解放思想、开拓奋进的70年。8月22日，记者从我省“奋力追赶超越 庆祝新中国成立70周年”系列新闻发布会第六场发布会上获悉：新中国成立70年来，延安人民继承发扬延安精神，埋头苦干，奋发图强，使山川大地逐渐实现由黄到绿的历史性转变，经济社会发展取得举世瞩目的成就。2018年，延安市生产总值1558.9亿元，是1949年的4585倍；财政总收入425.9亿元，是1952年的9950倍；城镇居民人均可支配收入由1985年的519元增加到2018年的32226元，农村居民人均可支配收入由1978年的53元增加到10786元。\n' +
          '\n' +
          '　　经济综合实力显著增强。改革开放以来，延安大力发展以油煤为主的特色工业、以苹果为主的特色农业和以文化旅游为龙头的现代服务业，生产总值年均增长11.2%。目前，苹果种植面积居全国地级市之首，产量占全省的三分之一、全国的九分之一，苹果收入占到农民收入的60%以上。2018年，延安游客数量及旅游综合收入分别为6344万人次和411亿元。延安贫困发生率由13.2%降至0.66%，实现区域性整体脱贫。\n' +
          '\n' +
          '　　经济增长新动能加速积聚。延安着力推进陕北高端能源化工基地、国家现代农业示范区建设和全域旅游示范市创建，加快产业转型升级，大力培育增长新动能。“三区九园”工业框架基本形成，144个现代农业示范园区、8个农产品加工园区、6大文化旅游产业园区、17个现代商贸物流园区加快建设。近年来，延安做好“无中生有”“有中生新”两篇文章，富县煤油气资源综合利用等277个重大转型项目建成投产，聚烯烃、苯乙烯等化工产品从无到有；556家新一代信息技术、智能制造等新经济企业落户延安。非公经济逐步发展壮大，规模达到456.8亿元，增加值占GDP比重达到29.3%。'
        }, {
          tendency: '中性',
          topicName: '地域信息',
          title: '陕西省市场监督管理局关于6批次食品不合格的通告',
          source: '西部网',
          channel: '陕西新闻网',
          linkAddress: 'http://news.foodmate.net/2019/08/531261.html',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '21',
          keyword: '陕西',
          type: '新闻',
          author: '刘云',
          releaseTime: '2019-08-08 08:50:55',
          grabTime: '2019-08-09 09:03:18',
          summaryNumber: '146',
          summary: '近期，陕西省市场监督管理局监督抽检（以下简称抽检）食用农产品、罐头2类食品202批次样品，抽样检验项目合格样品196批次，不合格样品6批次。检验和判定依据为食品安全国家标准、经备案有效的企业标准和产品明示标准',
          wordNumber: '4839',
          content: '近期，陕西省市场监督管理局监督抽检（以下简称抽检）食用农产品、罐头2类食品202批次样品，抽样检验项目合格样品196批次，不合格样品6批次。检验和判定依据为食品安全国家标准、经备案有效的企业标准和产品明示标准，具体情况通告如下（详见附件2、3）：\n' +
          '\n' +
          '　　一、总体情况\n' +
          '\n' +
          '　　食用农产品201批次，不合格6批次。罐头1批次检验项目全部合格。\n' +
          '\n' +
          '　　二、不合格产品情况\n' +
          '\n' +
          '　　1.商洛市永家乐商贸有限公司商洛分公司销售的标称乌鸡，恩诺沙星（以恩诺沙星与环丙沙星之和计）检出值为319μg/kg。农业部公告第235号规定为≤100μg/kg。检验机构为陕西出入境检验检疫局检验检疫技术中心。\n' +
          '\n' +
          '　　2.陕西永辉超市有限公司西安高新分公司销售的四季豆（豆类蔬菜），克百威检出值为0.03 mg/kg，标准值为 ≤0.02 mg/kg。检验机构为农业农村部食品质量监督检验测试中心（杨凌）。\n' +
          '\n' +
          '　　3.咸阳人人乐商业有限公司世纪大道第二购物广场销售的标称鸡胸肉，甲硝唑检出值为233μg/kg。农业部公告第235号规定为不得检出。检验机构为陕西出入境检验检疫局检验检疫技术中心。\n' +
          '\n' +
          '　　4.富平县家电摩托王国销售有限责任公司家天下购物广场南韩店销售的芹菜（叶菜类蔬菜），克百威检出值为0.074 mg/kg，标准值为 ≤0.02 mg/kg。检验机构为农业农村部食品质量监督检验测试中心（杨凌）。\n' +
          '\n' +
          '　　5.富平县家电摩托王国销售有限责任公司家天下购物广场南韩店销售的大青菜（叶菜类蔬菜），啶虫脒检出值为1.39 mg/kg，标准值为 ≤1 mg/kg；甲氨基阿维菌素苯甲酸盐检出值为0.19 mg/kg，标准值为 ≤0.1 mg/kg。检验机构为农业农村部食品质量监督检验测试中心（杨凌）。\n' +
          '\n' +
          '　　6.西安市人人乐超市有限公司景泽园购物广场销售的圆茄子（茄果类蔬菜），氧乐果检出值为0.037mg/kg，标准值为 ≤0.02mg/kg。检验机构为农业农村部食品质量监督检验测试中心（杨凌）。\n' +
          '\n' +
          '　　三、不合格产品处置情况\n' +
          '\n' +
          '　　对抽检中发现的不合格产品，省市场监督管理局已责成属地市场监管部门依法查处。商洛、西安、咸阳、渭南市场监督管理局已责令食品经营环节有关单位立即采取下架等措施控制风险。查处情况将于法定时限内向社会公布。\n' +
          '\n' +
          '　　消费者如在市场上发现或购买到本次公布信息中所涉不合格产品，请拨打食品投诉举报电话12315反映。'
        }, {
          tendency: '负面',
          topicName: '地域信息',
          title: '//@毛长江AA:延安生态环保部门查处一违法企业',
          source: '新浪微博',
          channel: '',
          linkAddress: 'http://weibo.com/6512191935/HAXkck93u',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '21',
          keyword: '宜川县',
          type: '微博',
          author: '小猪王子',
          releaseTime: '2019-05-11 08:48:38',
          grabTime: '2019-05-12 08:55:39',
          summaryNumber: '56',
          summary: '宜川县美洁洗涤厂位于该县丹州街道办鸭湾村，以洗涤酒店布草为主。今年3月21日，宜川生态环保分局在日常检查中发现，美洁洗涤厂在洗涤过程中，将产生的废水未经处理，直接排入河道，对河道水环境造成污染。生态环保执法人员当即对该洗涤厂的违法事实进行了现场勘察调查取证，并对相应涉案物品进行了现场查封。',
          wordNumber: '697',
          content: '一洗涤厂将生产过程中未经处理的废水，偷偷排入河道造成污染，而且在执法部门依法查处整改期间，竟然擅自撕毁封条，违法开工作业。7月17日晚，市生态环境局宜川分局在开展执法检查“回头看”行动中，再次查处宜川县美洁洗涤厂整改期间无视法规，擅自撕毁执法部门责令企业整改封条的违法行为。目前，此案已移交司法机关作进一步调查处理。\n' +
          '\n' +
          '● 宜川生态环保部门先前依法查封\n' +
          '\n' +
          '宜川县美洁洗涤厂位于该县丹州街道办鸭湾村，以洗涤酒店布草为主。今年3月21日，宜川生态环保分局在日常检查中发现，美洁洗涤厂在洗涤过程中，将产生的废水未经处理，直接排入河道，对河道水环境造成污染。生态环保执法人员当即对该洗涤厂的违法事实进行了现场勘察调查取证，并对相应涉案物品进行了现场查封，同时下达了《责令整改违法行为决定书》《行政处罚事先（听证）告知书》等，责令该洗涤厂立即停止违法排污行为并限期整改。与此同时，宜川生态环保执法人员还切断了该洗涤厂与城区污水管网连接的所有管道，要求该厂采取切实有效的措施进行整改，确保整改到位并经验收达标后再生产。\n' +
          '\n' +
          '● 擅自撕毁封条违法作业\n' +
          '\n' +
          '今年以来，宜川县水环境质量形势严峻。为巩固之前对洗涤行业的专项整治成效，7月17日晚，市生态环境局宜川分局执法人员开展“回头看”，对该洗涤厂再次检查时，发现该洗涤厂卷闸门紧闭，但是被黑布蒙住的窗户却透射出微弱的灯光。执法人员发现，洗涤厂内灯火通明，操作间里工人们忙碌地进行洗涤作业，五六台大型洗衣机不停运转。生态环保执法人员立即叫人打开卷闸门，对该洗涤厂的再次违法行为进行了调查取证。\n' +
          '\n' +
          '市生态环境局宜川分局局长乔惠芸告诉笔者，宜川县美洁洗涤厂在依法查封整改工作未能完成达标的情况下，擅自撕毁封条、开启配电柜电源非法投入生产，违法排放污染物，严重违反了环保法等法规。针对该洗涤厂一而再、再而三的违法行为，生态环保执法人员分别对该洗涤厂负责人、工作人员等进行了调查谈话，同时依据环保法四个配套办法及《治安管理处罚法》等法律法规规定，将该案件移送至司法机关，作进一步处理。'
        }, {
          tendency: '负面',
          topicName: '地域信息',
          title: '陕西省对校园食品安全“零容忍”',
          source: '西安日报',
          channel: '',
          linkAddress: 'http://www.cfsn.cn/front/web/site.indexdfshow?newsid=9748',
          browseNumber: '0',
          answerNumber: '0',
          reprintNumber: '13',
          keyword: '西安',
          type: '新闻',
          author: '刘会斌',
          releaseTime: '2019-08-20 08:44:30',
          grabTime: '2019-08-21 08:55:36',
          summaryNumber: '139',
          summary: '近日，陕西省市场监督管理局发出《加强秋季开学期间食品安全监管工作的通知》，对在学校食品安全监督检查、监督抽检和举报投诉中发现的食品安全问题，以“零容忍”的态度，发现一起，严查一起，涉嫌犯罪的，立即移送公安机关处理。',
          wordNumber: '800',
          content: '近日，陕西省市场监督管理局发出《加强秋季开学期间食品安全监管工作的通知》，对在学校食品安全监督检查、监督抽检和举报投诉中发现的食品安全问题，以“零容忍”的态度，发现一起，严查一起，涉嫌犯罪的，立即移送公安机关处理。年底前，所有学校食堂要全部实现“明厨亮灶”，鼓励学校食堂建设先进“阳光厨房”。\n' +
          '学校食品安全风险基本控制\n' +
          '通知称，今年以来，各地各部门高度重视学校食品安全，相继采取了行之有效的措施，学校食品安全风险基本得到控制。但部分学校仍存在食品安全主体责任落实不到位，从业人员培训考核、岗前健康检查流于形式，从业人员岗位责任执行不到位，餐饮具洗消不彻底，食材加工前不认真检查食材的安全性等现象。当前，学校食堂建设不标准、管理不规范、责任不落实等问题仍有存在，校园食品安全基础依然薄弱，食品安全事件时有发生，与人民群众的期盼还有差距。各地各级要以兜牢底线为己任，自觉做到未雨绸缪，防微杜渐，坚决杜绝食品安全事件发生。\n' +
          '对校园食品安全“零容忍”\n' +
          '各地各部门要集中人力精力，在开学前2周时间内，对本行政区域内的所有学校和幼儿园食堂、向学校提供送餐的集体用餐配送单位、校园及其周边一定范围内的食品经营者开展一次全面监督检查。组织学校排查食品安全隐患，重点是食品安全管理机构和制度是否健全并运转高效；饮用水、库存食材、环境卫生是否安全；进货查验、加工制作、清洗消毒、食品留样、从业人员健康管理、培训考核等制度是否落实。\n' +
          '严查学校周边“三无”食品、假冒伪劣食品、餐饮具清洗消毒不彻底等违法行为。公开学校行政许可、食材来源、检查抽检和校外托餐等监管信息，主动接受社会监督。建立“一户一档”风险隐患排查清单，对排查出的问题，要规定整改时限，逐一督促整改。对在学校食品安全监督检查、监督抽检和举报投诉中发现的食品安全问题，以“零容忍”的态度，发现一起，严查一起。涉嫌犯罪的，要立即移送公安机关处理。'
        }],
        options: [],
        props: {
          label: 'cityName',
          value: 'cityCode'
        },
        tableHeight: null
      }
    },
    methods: {
      query(flag, hand) {
        // this.listLoading = true
        // this.page = flag ? 1 : this.page
        // const para = this.filters
        // para.pageNum = this.page
        // para.pageSize = this.pageSize
        // if (hand) { // 手动点击时，添加埋点参数
        //    para.logFlag = 1
        // }
        // this.$query('', para).then((response) => {
        //   this.listLoading = false
        //   this.list = response.data.list
        //   this.listTotal = response.data.totalCount
        //   this.pageSize = response.data.pageSize
        // }).catch(() => {
        //   this.listLoading = false
        // })
      },
      handleCurrentChange(currentPage) {
        this.page = currentPage
        this.query(false, true)
      },
      handleSizeChange(val) {
        this.page = 1
        this.pageSize = val
        this.query(false, true)
      },
      handleEdit(row) {
        // 埋点参数
        // const param = {
        //   logFlag: 1,
        // }
        this.$message({
          message: '提取成功', type: 'success'
        })
      },
      handleDetail(row) {
        this.$router.push({ path: '/lyricalInfo/alarmInfo/detail/', query: { row: row }})
      },
      clear() {
        // this.filters = {
        //   DWMC: '', DWXZ: '', DWLB: '', XYLB: '', SFNS: ''
        // }
        // this.query(true, true)
      }
    },
    mounted() {
      this.tableHeight = document.documentElement.clientHeight - document.querySelector('.el-form').offsetHeight - 180
      this.query(true)
    }
  }
</script>
<style scoped>
</style>
