<template>
  <div class="FloatTipMsg">
    <p style="text-align: center; font-size: 18px; padding-top: 0">
      关于转发公安部《公安信息共享查询应用 “七不准”》的通知
    </p>
    <p>
    一、非因工作原因，不准使用“公安云搜索”等公安信息共享查询应用系统，不准使用通过“公安云搜索”等公安信息共享查询应用系统获取的信息。
    </p>
    <p>
    二、不准将“公安云搜索”等公安信息共享查询应用系统授权数字证书转借他人使用。
    </p>
    <p>
    三、不准违规申报和审批“公安云搜索”等公安信息共享查询应用系统授权用户。
    </p>
    <p>
    四、不准非法扫描、入侵“公安云搜索”等公安信息共享查询应用系统，扰乱系统正常运行。
    </p>
    <p>
    五、不准公开宣传、与无关人员谈论“公安云搜索”等公安信息共享查询应用系统及其相关内容。
    </p>
    <p>
    六、不准泄露、传播或出售通过“公安云搜索”等公安信息共享查询应用系统获取的信息。
    </p>
    <p>
    七、不准对“公安云搜索”等公安信息共享查询系统应用违规行为隐瞒不报、包庇袒护。
    </p>
    <p>
    对违反上述规定的民警，按照《公安机关人民警察纪律条令》有关规定给予纪律处分，并视情依据《公安机关追究领导责任暂行规定》追究相关领导责任；构成犯罪的，依法追究刑事责任。
    </p>
  </div>
</template>

<script>
  export default {
    name: 'FloatTipMsg',
    data() {
      return {}
    },
    methods: {}
  }
</script>

<style scoped>
.FloatTipMsg p{
  padding: 10px;
}
</style>
